app/views/student/layouts/_navbar.html.erb

SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1
---
                    <li><%= link_to "Dashboard", student_dashboard_path %></li>
                    <li><%= link_to "Course", course_path(Course.first.id) %></li>