app/controllers/courses_controller.rb

  def index
    @courses = Course.all
---
SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1

  def show
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses"  WHERE "courses"."id" = ? LIMIT 1  [["id", 1]]