app/controllers/profiles_controller.rb

	def new
		if !current_user.profile.blank?
---
SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."user_id" = ? LIMIT 1  [["user_id", 1]]