app/views/layouts/_navbar.html.erb

SELECT  "courses".* FROM "courses"   ORDER BY "courses"."id" ASC LIMIT 1
---
                </li>
                <li><%= link_to "Course", course_path(Course.first) %></li>